import Slider from "react-slick";
import styled from "@emotion/styled";

const CarouselDiv = styled.div`
  width: 492px;
  height: 593px;
  background-color: #fff;
  padding: 46px 40px;
`;

export const Carousel = () => {
  const settings = {
    dots: true,
    infinite: true,
    speed: 500,
    slidesToShow: 1,
    slidesToScroll: 1,
  };
  return (
    <CarouselDiv>
      <Slider {...settings}>
        <div className="item">
          <h3>КОНЦЕПЦІЯ:</h3>
          <p>
            Магазин-склад-бар Алкоопт успішно поєднує найнижчі ціни та високий
            рівень обслуговування. Зазвичай нас запитують, "Як ви досягаєте
            таких низьких цін і при цьому створюєте зручний та привітний
            магазин?" Лише завдяки тривалим переговорам нам вдалося працювати у
            цьому форматі. Пройдіть цей шлях разом з нами, і ви отримаєте
            можливість продавати алкоголь за найнижчими цінами, заробляючи при
            цьому. Це місце, де доступність високоякісного алкоголю поєднується
            з ідеальним обслуговуванням, дозволяючи спробувати будь-яку пляшку
            за ціною її покупки.
          </p>
        </div>
        <div className="item">
          <h3>ДОСВІД:</h3>
          <p>
            Наш проект реалізовано за участю висококваліфікованих фахівців, які
            мають значний досвід у сфері алкоголю та успішно працюють на ринку.
            Ми витратили багато часу на формування нашої команди і пройшли
            важкий шлях разом. Це дозволяє нам оптимально підібрати асортимент
            для будь-якого регіону, використовуючи найточніші аналітичні дані,
            забезпечуючи тим самим прибуток кожного сантиметра ваших полиць і
            відповідаючи потребам покупців.
          </p>
        </div>
        <div className="item">
          <h3>СЕРВІС:</h3>
          <p>
            Наша компанія впроваджує систему контролю, яка забезпечує постійне
            дотримання високих стандартів обслуговування. Ефективна система
            навчання персоналу, яка легко впроваджується в ваш магазин,
            забезпечує високий рівень сервісу. Завдяки інноваційній системі
            Віртуального сомельє, покупці отримують інформацію про будь-який
            товар, просто скануючи QR-код на ціннику. Цей простий та ефективний
            механізм дозволяє кожному покупцеві обрати пляшку відповідно до
            власних уподобань та експертного опису асортименту.
          </p>
        </div>
        <div className="item">
          <h3>АСОРТИМЕНТ:</h3>
          <p>
            Наші Товарні аналітики постійно моніторять темпи продажів і
            оптимізують асортимент, спрямовуючись на підвищення прибутковості та
            задоволення клієнтських очікувань. В нашому асортименті ви знайдете
            широкий вибір товарів, відповідних різноманітним смаковим
            уподобанням: від бюджетних класичних напоїв до унікальних рідкісних
            позицій з багатогранним смаком.
          </p>
        </div>
        <div className="item">
          <h3>СТАНДАРТИЗАЦІЯ:</h3>
          <p>
            Алкоопт - це виразно досконалий організм, де кожен етап процесу
            вивчений і максимально оптимізований. Повний пакет відпрацьованих та
            ефективних стандартів та алгоритмів допоможе вам з першого дня
            організувати всі робочі процеси і заощадити кошти.
          </p>
        </div>
        <div className="item">
          <h3>ЦІНИ:</h3>
          <p>
            Наші довгострокові та ефективні відносини з виробниками та
            дистриб'юторами створюють умови для реалізації товарів у роздріб за
            оптовими цінами. Щоденно наші аналітики аналізують ціни конкуруючих
            мереж, і ми можемо запевнити, що наші ціни завжди найнижчі.
          </p>
        </div>
      </Slider>
    </CarouselDiv>
  );
};
